Repository: 84000/data-translation-memory
Catalog: toh116-v1.tmx
Source language: bo
Languages: en

source: ཁང་པ་བརྩེགས་མ་དེ་དག་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་འཛམ་བུའི་གླིང་དུ་མངོན་པར་ཕྱོགས་ཤིང་ཆོས་འཆད་པ་ཡང་བཞུགས་ཏེ།
en: “In those many-storied palaces, there are seated tathāgatas who teach the Dharma to the humans in Jambudvīpa.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་བསྟན་པ་སྟོན་པར་མཛད་དེ། །
en: They teach the six perfections:

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་སྟོན་པར་མཛད། །
en: they teach the perfection of generosity,

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་སྟོན་པར་མཛད།
en: they teach the perfection of conduct,

source: བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་སྟོན་པར་མཛད།
en: they teach the perfection of patience,

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་སྟོན་པར་མཛད།
en: they teach the perfection of diligence,

source: བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་སྟོན་པར་མཛད།
en: they teach the perfection of meditation,

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་སྟོན་པར་མཛད་དེ།
en: and they teach the perfection of wisdom.

source: དེ་ལྟར་དེ་དག་འཛམ་བུའི་གླིང་ན་གནས་པའི་མི་རྣམས་ལ་ཆོས་རྣམ་པ་སྣ་ཚོགས་དག་དུས་དུས་སུ་འཆད་དོ། །
en: They teach various kinds of Dharma, continually teaching the humans who live in Jambudvīpa.

source: དེ་ལྟར་རིགས་ཀྱི་བུ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་བ་སྤུའི་ཁུང་བུ་དེ་དག་ཛེ་ཏའི་ཚལ་གྱི་གཙུག་ལག་ཁང་དུ་ཕྱིན་པའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། མི་དང་། མི་མ་ཡིན་པ་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། མཐུ་བོ་ཆེ་ལ་སོགས་ཏེ་ལྷའི་བུ་ཚོགས་པ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་དུ་མ་དག་གིས་མཐོང་ངོ་། །
en: Thus, noble son, they see the pores of Bodhisattva Mahāsattva Avalokiteśvara. They also see deities such as devas, nāgas, yakṣas, asuras, garuḍas, kiṃnaras, mahoragas, humans, nonhumans, Maheśvara, and Nārāyaṇa assembled in Jetavana Monastery, and many millions of trillions of bodhisattvas assembled there.

source: བཅོམ་ལྡན་འདས་བ་སྤུའི་ཁུང་བུ་གཞན་དག་མཆིས་སམ་མ་མཆིས།
en: “Bhagavat, are there no other pores?”

source: རིགས་ཀྱི་བུ་དེ་འདས་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་རྐང་པ་གཡས་པའི་མཐེ་བོ་དེ་ལས་མཚོ་ཆེན་པོ་བཞི་འབྱུང་སྟེ་
en: “Noble son, beyond that pore are the four great oceans that come from the big toe of Bodhisattva Mahāsattva Avalokiteśvara’s right foot.

source: གཏིང་དཔོག་མི་ནུས་སོ། །
en: Their depth is immeasurable.

source: གང་གི་ཚེ་ན་རྐང་པ་གཡས་པའི་མཐེ་བོ་ལས་ཆུ་བྱུང་བ་དེའི་ཚེ་རྟ་རྒོད་མའི་གདོང་ལྟ་བུར་འབབ་སྟེ། །
en: When water comes from the right big toe, it falls on Vaḍavāmukha,

source: དེའི་ཚེ་ཐལ་བའི་ཕུང་པོར་འགྲོའོ། །
en: transforming it into a heap of ash.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་བྱིན་གྱིས་བརླབས་ནི་དེ་འདྲའོ།
en: Noble son, that is the kind of blessing that Bodhisattva Mahāsattva Avalokiteśvara has.”

source: བཅོམ་ལྡན་འདས་བ་སྤུའི་ཁུང་བུ་དེ་ཡང་མ་མཆིས་པ་ལགས་སམ།
en: “Bhagavat, is there yet another pore?”

source: རིགས་ཀྱི་བུ་དེ་ཡང་མེད་པ་ཡིན་ནོ།
en: “There are no more, noble son.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་མཆིའམ། །
en: “Bhagavat, is Bodhisattva Mahāsattva Avalokiteśvara coming?”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ནི་ཛེ་ཏའི་ཚལ་གྱི་གཙུག་ལག་ཁང་འདི་ཉིད་དུ་ང་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། དབང་ཕྱུག་ཆེན་པོ་རྒྱུ་དང་བཅས་ཏེ་ལུང་བསྟན་པའི་ཕྱིར་འོང་ངོ་། །
en: “Bodhisattva Mahāsattva Avalokiteśvara will come to this great monastery of Jetavana in order to see me, to bow down to me, to honor me, and to give a prophecy concerning the deity Maheśvara in a realm within this universe.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་འོད་ཟེར་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། ཤེལ་གྱི་ཁ་དོག་དང་། དངུལ་གྱི་ཁ་དོག་བཏང་ནས་ཁ་དོག་དེ་དག་ཛེ་ཏའི་ཚལ་གྱི་གཙུག་ལག་ཁང་དུ་སོང་ངོ་། །
en: The noble Bodhisattva Mahāsattva Avalokiteśvara radiated blue, yellow, red, white, crystal, and silver light rays, and those light rays went to Jetavana.

source: སོང་ནས་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་ཏེ།
en: When they came there, they circled the Bhagavat three times.

source: བསྟིར་མེད་པའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་སོང་ངོ་། །
en: Then they left Jetavana Monastery and went to the great Avīci hell.

source: སོང་ནས་བསྟིར་མེད་པའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་བསིལ་བར་གྱུར་ཏོ།
en: When they arrived there, they cooled the great Avīci hell.

source: དེའི་ཚེ་ཛེ་ཏའི་ཚལ་གྱི་གཙུག་ལག་ཁང་དུ་ལྟས་བཟང་པོ་བྱུང་བར་གྱུར་པ་
en: At that time, good omens manifested in Jetavana Monastery.

source: ཛེ་ཏའི་ཚལ་གྱི་གཙུག་ལག་ཁང་དེ་ལྷའི་གསེར་རིན་པོ་ཆེར་སྣང་བར་གྱུར་ཏེ།
en: At that time, Jetavana Monastery appeared to shine like divine gold.

source: ཛེ་ཏའི་ཚལ་གྱི་གཙུག་ལག་ཁང་དེ་ལྟར་སྣང་ངོ་། །
en: That is what Jetavana Monastery looked like.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་ནས་བྱུང་སྟེ། ཛེ་ཏའི་ཚལ་གྱི་གཙུག་ལག་ཁང་ག་ལ་བ་དེ་ལོགས་སུ་སོང་ནས་
en: Bodhisattva Mahāsattva Avalokiteśvara then left the realm of Sukhāvatī and went to Jetavana Monastery, and eventually arrived there.

source: རིམ་གྱིས་ཛེ་ཏའི་ཚལ་གྱི་གཙུག་ལག་ཁང་ག་ལ་བ་དེར་ཕྱིན་ཏོ། །དེ་ནས་ཛེ་ཏའི་ཚལ་གྱི་གཙུག་ལག་ཁང་དུ་སོང་བ་དང་། །
en: He went inside Jetavana Monastery, bowed his head to the Bhagavat’s feet, and sat to one side.

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་བྱ་ཀ་ལ་པིང་ཀའི་དབྱངས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Bhagavat, with the voice of the cuckoo, asked,

source: རིགས་ཀྱི་བུ་ཁྱོད་ངལ་ལམ།
en: “Noble son, are you tired?

source: ཁྱོད་ཉོན་མོངས་སམ།
en: Are you weary?

source: ཁྱོད་ཀྱིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱས་སམ།
en: Have you completely ripened beings?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Bodhisattva Mahāsattva Avalokiteśvara said to the Bhagavat,

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་ལྟར་བཀའ་སྩལ་པ་བཞིན་ཏེ། བདག་གིས་དེ་ལྟ་བུའི་ལས་ཀྱིས་བསྒྲུབས་སོ། །
en: “I have done as the Bhagavat instructed. I have accomplished the task.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རིགས་ཀྱི་བུ་གང་ཁྱོད་ཀྱིས་དེ་འདྲ་བའི་ལས་ཀྱིས་བསྒྲུབས་པ་ལེགས་སོ་ལེགས་སོ། །ཞེས་བྱ་བ་བྱིན་ནོ། །
en: The Bhagavat gave his approval, saying, “Noble son, it is excellent that you have accomplished the task. Excellent.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་པད་མ་ཕུལ་ནས།
en: Then Bodhisattva Mahāsattva Avalokiteśvara offered lotus flowers to the Bhagavat and

source: བཅོམ་ལྡན་འདས་ལ་དེ་བཞིན་གཤེགས་པ་སྣང་བ་མཐའ་ཡས་པས་མེ་ཏོག་པད་མ་འདི་དག་གསོལ་ཏེ་བསྙུང་བ་མ་མཆིས་སམ། འོ་བརྒྱལ་བ་མ་མཆིས་སམ། བཞེངས་པ་ཡང་ངམ། བདེ་བ་ལ་རེག་པར་གནས་སམ་ཞེས་ཀྱང་གསུང་ངོ་ཞེས་སྨྲས་ནས། །
en: said, “Bhagavat, the tathāgata Amitābha presents you with these lotus flowers and hopes you are not unwell, not fatigued, that you are in good health, and that life is pleasant.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཞེས་ཏེ་གཡོན་ཕྱོགས་སུ་བཞག་གོ། །
en: The Bhagavat accepted the lotuses and placed them on his left.

source: དེ་ནས་ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then the deva Maheśvara came to the Bhagavat, bowed his head to the Bhagavat’s feet, and said,

source: བཅོམ་ལྡན་འདས་བདག་གིས་ལུང་སྟོན་པའི་བཤད་པ་ཐོབ་པར་མཛད་དུ་གསོལ། །
en: “Bhagavat, I pray that you give me a prophecy.”

source: སོང་ཤིག་དང་ཁྱོད་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་ལུང་སྟོན་པར་འགྱུར་རོ།
en: “Go, noble son, to Bodhisattva Mahāsattva Avalokiteśvara, who will give you the prophecy.”

source: དེ་ནས་ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོ་སོང་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་རྐང་པ་ལ་ཕྱག་འཚལ་ནས་
en: So the deva Maheśvara went and bowed down to the feet of Bodhisattva Mahāsattva Avalokiteśvara and

source: པད་མའི་ཞལ།
en: who has a lotus face,

source: པད་མ་ལ་དགྱེས་པ། །
en: who loves the lotus,

source: ཕྱག་ན་མེ་ཏོག་པད་མ་བཟང་པོ་མངའ་བ། པད་མའི་དཔལ་དང་ལྡན་པ། །
en: who has a beautiful lotus in his hand, who has the splendor of lotuses,

source: ཡོངས་སུ་བསྐོར་བ་འགྲོ་བ་དབུགས་འབྱིན་པར་མཛད་པ། སའི་སྤྱན་མཆོག་མཛད་པ། སིམ་པར་མཛད་པ་
en: who travels around, who brings relief to beings, who completely illuminates the world, and who brings comfort.”

source: ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ལ་དེ་ལྟར་བསྟོད་ནས་ཁ་རོག་སྟེ་འདུག་པ་དང་། །
en: The deva Maheśvara praised Bodhisattva Mahāsattva Avalokiteśvara in that way and then sat silently.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་དབང་ཕྱུག་ཆེན་པོ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then Bodhisattva Mahāsattva Avalokiteśvara asked the deva Maheśvara,

source: རིགས་ཀྱི་བུ་ཁྱོད་ཅིའི་ཕྱིར་ཁ་རོག་སྟེ་འདུག
en: “Noble son, why are you silent?”

source: དེ་ནས་ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The deva Maheśvara answered,

source: བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་སྩལ་དུ་གསོལ། །
en: “I request the prophecy of my unsurpassable true enlightenment.”

source: དེ་ནས་སྤྱན་རས་གཟིགས་ཀྱིས་གསུངས་པ།
en: “Avalokiteśvara said,

source: རིགས་ཀྱི་བུ་ཁྱོད་འཇིག་རྟེན་གྱི་ཁམས་ཕྱེ་བ་ཞེས་བྱ་བར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས། རིག་པ་དང་རྐང་པར་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། བླ་ན་མེད་པ་སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དབང་ཕྱུག་ཅེས་བྱ་བར་འགྱུར་རོ།
en: “Noble son, in the world named Vivṛta, you will be the Tathāgata, the arhat, the samyaksaṃbuddha, perfect in wisdom and conduct, the sugata, the knower of the world, the unsurpassable guide who tames beings, the teacher of gods and humans, the buddha, the Bhagavat Bhasmeśvara.”

source: དེ་ནས་ལྷ་མོ་ཨུ་མ་སོང་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས།
en: Then Umādevī came and bowed her head to Bodhisattva Mahāsattva Avalokiteśvara’s feet and

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ཆེན་པོ་སྲོག་སྦྱིན་པར་མཛད་པ།
en: “I pay homage to Avalokiteśvara, great lord, who gives life,

source: སའི་སྤྱན་མཆོག་མཛད་པ།
en: who completely illuminates the world,

source: པད་མ་བཟང་པོ་ཕྱག་ན་མངའ་བ།
en: who has a beautiful lotus in his hand,

source: པད་མའི་དཔལ་དང་ལྡན་པ།
en: who has the splendor of beautiful lotuses,

source: ཡོངས་སུ་བསྐོར་བ།
en: who travels around,

source: མྱ་ངན་ལས་འདའ་བའི་ས་སྟོན་པ།
en: who brings beings to nirvāṇa,

source: ལེགས་པར་དགོངས་པར་མཛད་པ།
en: who creates excellent minds,

source: ཆོས་འཛིན་པ་
en: and who holds the Dharma.”

source: དེ་ལྟར་ལྷ་མོ་ཨུ་མས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ལ་བསྟོད་དེ་གསོལ་པ། །
en: Umādevī praised Bodhisattva Mahāsattva Avalokiteśvara in that way and then said,

source: བུད་མེད་ཀྱི་ལུས་སྨད་པ་ལས་བདག་ཡོངས་སུ་ཐར་བར་མཛད་དུ་གསོལ།
en: “I pray that you free me from this inferior female body of a woman.

source: མངལ་ན་གནས་ཤིང་ཤ་མ་གང་བའི་སྡུག་བསྔལ་བ་དང་རྟག་ཏུ་འཛིན་པ་ལས་བདག་ཡོངས་སུ་ཐར་བར་མཛད་དུ་གསོལ།
en: I pray that you free me from the suffering of the dark impurities in the womb, and from always being owned.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then Bodhisattva Mahāsattva Avalokiteśvara said to her,

source: སྲིང་མོ་ཁྱོད་འཇིག་རྟེན་གྱི་ཁམས་གངས་ཀྱི་རིའི་གཡས་ཕྱོགས་ཀྱི་ངོས་སུ་ཨུ་མའི་དབང་ཕྱུག་ཅེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས། རིག་པ་དང་རྐང་པར་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ།
en: “Sister, your realm will be on the southern slope of Himavat, the king of mountains.” You will be the Tathāgata, the arhat, the samyaksaṃbuddha, perfect in wisdom and conduct, the sugata, the knower of the world,

source: བླ་ན་མེད་པ་སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །
en: the unsurpassable guide who tames beings, the teacher of gods and humans, the buddha, the Bhagavat Umeśvara.”

source: དེ་ནས་ལྷ་མོ་ཨུ་མས་ལུང་བསྟན་པ་ཐོབ་བོ།
en: That was the prophecy that Umādevī received.

source: ལྟོས་ཤིག་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏེ།
en: “Look, Sarva­nīvaraṇa­viṣkambhin, Bodhisattva Mahāsattva Avalokiteśvara has given them prophecies of the highest complete enlightenment.

source: དབང་ཕྱུག་ཆེན་པོའི་ལེའུ་འདི་ཡང་བཤད་དོ། །
en: This, noble son, is entitled ‘the Maheśvara episode.’ ”

source: བཅོམ་ལྡན་འདས་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་མཆིས་ཏེ།
en: “Bhagavat, Avalokiteśvara has come.

source: ལོང་བ་དག་གིས་ནི་མིག་ཐོབ་བོ། །
en: I who was blind can now see.

source: དེ་རིང་བདག་ནི་ཚེའི་འབྲས་བུ་མཆིས་པར་གྱུར་ཏོ། །
en: Today my life has borne fruit.

source: བདག་དེ་རིང་ནི་བསམ་པ་བཞིན་དུ་གྲུབ་བོ། །
en: Today my wishes have come true.

source: བདག་དེ་རིང་ནི་བསམ་པ་ཡོངས་སུ་རྫོགས་སོ། །
en: Today my wishes have been fulfilled.

source: བདག་དེ་རིང་ནི་བྱང་ཆུབ་ཀྱི་ལམ་ལ་བར་ཆད་མ་མཆིས་པར་གྱུར་ཏོ། །
en: Today my path to enlightenment has been cleansed.

source: ལེགས་པར་དགོངས་པ་ཆོས་ཀྱི་སྐུ་མྱ་ངན་ལས་འདས་པ་སྟོན་ཏོ། །
en: I have been taught correct thought, the dharmakāya, and nirvāṇa.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཡང་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Sarva­nīvaraṇa­viṣkambhin then said to the Bhagavat,

source: བཅོམ་ལྡན་འདས་དེ་རིང་བདག་ལ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་ཡོན་ཏན་གྱི་བྱེ་བྲག་བཤད་དུ་གསོལ།
en: “Bhagavat, I pray that you teach today the special qualities of Avalokiteśvara.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་འདི་ལྟ་སྟེ། །
en: The Bhagavat said, “Sarva­nīvaraṇa­viṣkambhin, it like this:

source: དཔེར་ན་རིའི་རྒྱལ་པོ་ཁོར་ཡུག་དང་། ཁོར་ཡུག་ཆེན་པོ་དང་། རིའི་རྒྱལ་པོ་མུ་ཙི་ལིན་ད་དང་། རིའི་རྒྱལ་པོ་ནག་པོ་དང་། ནག་པོ་ཆེན་པོ་དང་། རིའི་རྒྱལ་པོ་གསུས་ཤོལ་དང་། རིའི་རྒྱལ་པོ་མི་སྟོན་པ་དང་། རིའི་རྒྱལ་པོ་ཐམས་ཅད་དུ་གཏོགས་པ་དང་། རིའི་རྒྱལ་པོ་འབར་བའི་ཁ་དང་། རིའི་རྒྱལ་པོ་རྩེ་མོ་བརྒྱ་པ་དང་། རིའི་རྒྱལ་པོ་ཁང་པ་དང་། རིའི་རྒྱལ་པོ་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དང་། རིའི་རྒྱལ་པོ་སྟོན་པ་དང་། རིའི་རྒྱལ་པོ་དུས་མ་ཡིན་པར་སྟོན་པ་དང་། རིའི་རྒྱལ་པོ་དེ་དག་སྲང་གཅིག་ལ་བཏབ་ན།
en: there are the kings of mountains Mount Cakravāla and Mount Mahācakravāla, the kings of mountains Mount Mucilinda and Mount Mahāmucilinda, the kings of mountains Mount Kāla and Mount Mahākāla, the kings of mountains Mount Saṃsṛṣṭa and Mount Mahāsaṃsṛṣṭa, the king of mountains Mount Pralambodara, the king of mountains Mount Anādarśaka, the king of mountains Mount Kṛtsrāgata, the king of mountains Mount Jālinīmukha, the king of mountains Mount Śataśṛṅga, the king of mountains Mount Bhavana, the king of mountains Mount Mahāmaṇiratna, the king of mountains Mount Sudarśana, and the king of mountains Mount Akāladarśana.

source: རིགས་ཀྱི་བུ་ངས་རིའི་རྒྱལ་པོ་དེ་དག་སྲང་འདི་སྙེད་ཅིག་གོ་ཞེས་སམ། སྲང་བརྒྱའོ་ཞེས་སམ། སྲང་སྟོང་ངོ་ཞེས་སམ། བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་ཞེས་སམ། གྲངས་སུ་ཡང་། ཆར་ཡང་། བགྲང་བར་ཡང་ནུས་ཀྱི།
en: “I can calculate, noble son, the number, parts, and groups of how many palas are in those mountains, how many hundreds of palas, or thousands of palas, or millions of trillions of palas, but,

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ནི་བགྲང་མི་ནུས་སོ།
en: noble son, I cannot calculate Bodhisattva Mahāsattva Avalokiteśvara’s accumulation of merit.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་བསོད་ནམས་ཀྱི་ཚོགས་ནི་བགྲང་མི་ནུས་སོ།
en: I cannot calculate Bodhisattva Mahāsattva Avalokiteśvara’s accumulation of merit.

source: དཔེར་ན་ཤིང་ཤིར་ཥའིཚལ་ནི་ངས་འདབ་མ་རེ་རེ་ནས་བགྲང་ནུས་ཀྱི།
en: I can count each leaf in a forest of agarwood trees, but,

source: དཔེར་ན་རི་རབ་རིའི་རྒྱལ་པོ་ནི་གྲོ་གའི་ཕུང་པོར་གྱུར།
en: If the king of mountains Sumeru were to become birch bark,

source: རྒྱ་མཚོ་མཆིང་རྣམ་ཆེན་པོ་ནི་སྣག་ཚར་གྱུར།
en: and if the vast ocean were to become an inkwell,

source: གླིང་ཆེན་པོ་བཞི་ན་གནས་པའི་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དེ་དག་ཐམས་ཅད་ནི་ཡི་གེ་པར་གྱུར་ཏེ། རིའི་རྒྱལ་པོ་མཐའ་ཡས་མུ་མེད་པ་ཡི་གེར་བྲིས་ཀྱང་ཡི་གེ་འབྲུམ་བུ་རེ་རེ་ནས་བགྲང་ནུས་ཀྱི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་བསོད་ནམས་ཀྱི་ཚོགས་ནི་བགྲང་མི་ནུས་སོ། །
en: and if all the men, women, boys, and girls who live in the four continents were to become scribes, and if they were to write on the limitless, endless extent of Mount Sumeru as birch bark, I would be able to count every single letter, but, noble son, I cannot calculate Bodhisattva Mahāsattva Avalokiteśvara’s accumulation of merit.

source: དཔེར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་ཕྲག་བཅུ་གཉིས་དང་མཉམ་པའི་ན་བཟའ་དང་། བཤོས་དང་། མལ་སྟན་དང་། ན་བའི་རྐྱེན་གྱི་སྨན་གྱི་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་བསྙེན་བཀུར་བྱས་ན། དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་བསྙེན་བཀུར་བྱས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ནི་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་སྐྲའི་ཉག་མ་གཅིག་གི་རྩེ་མོ་ལ་གནས་པའི་བསོད་ནམས་དང་མཉམ་མོ།
en: If someone were to provide tathāgatas, arhats, and samyaksaṃbuddhas as numerous as the grains of sand in twelve Ganges Rivers with robes, food, bowls, bedding, seats, necessary medicine, and utensils for an eon, the accumulation of merit that would come from serving those tathāgatas would only equal the merit of the tip of one hair on the body of Bodhisattva Mahāsattva Avalokiteśvara.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ནི་ཏིང་ངེ་འཛིན་བརྒྱ་ཕྲག་དུ་མ་དང་ལྡན་ཏེ། འདི་ལྟ་སྟེ།
en: Bodhisattva Mahāsattva Avalokiteśvara has many hundreds of thousands of samādhis:

source: རབ་ཏུ་འཇོམས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། །
en: the samādhi named Completely Defeating,

source: རྒྱན་པར་བྱེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Adorning,

source: རྒྱན་པར་མི་བྱེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Unadorning,

source: གློག་གི་སྤྱན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Lightning’s Illumination,

source: བཟོད་པར་བྱེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Being Patient,

source: གཟི་ཅན་ཆེན་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Great Brilliance,

source: རྡོ་རྗེའི་ཕྲེང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Vajra Garland,

source: དམ་པ་སྦྱིན་བྱེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Sublime Gift,

source: མཐུ་བརྒྱ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། །
en: the samādhi named Hundred Strengths,

source: བཀོད་པ་མཐའ་ཡས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Endless Array,

source: སྤོབས་པའི་ཕུང་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Summit of Mental Brilliance,

source: རྡོ་རྗེའི་སྒོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། །
en: the samādhi named Vajra Doorway,

source: རྟག་ཏུ་དམ་པ་སྦྱིན་བྱེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Continuous Sublime Gift,

source: དབང་པོ་ཡོངས་སུ་ཐར་བྱེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Liberation from the Senses,

source: ཞེ་སྡང་ཡོངས་སུ་ཐར་བྱེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Liberation from Anger,

source: དབང་པོ་དམ་པའི་མིག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named the Senses’ Sublime Illumination,

source: ཉིན་བྱེད་དམ་པའི་མིག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Day-Maker’s Sublime Illumination,

source: ཆོས་ལ་མངོན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Facing the Dharma,

source: རྡོ་རྗེའི་མངལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Vajra Womb,

source: ཤིན་ཏུ་སྟོན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Well Taught,

source: མྱ་ངན་འདའ་བྱེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Creating Nirvāṇa,

source: འོད་ཟེར་མཐའ་ཡས་སྒྲུབ་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Creating Infinite Light Rays,

source: རྣལ་འབྱོར་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Creating Yoga,

source: འཛམ་བུའི་གླིང་གི་དམ་པའི་མིག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Complete Illumination of the World,

source: སྐྱེ་དགུའི་གནས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། །
en: the samādhi named Abode of Beings,

source: མི་ཟད་པར་བྱེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། །
en: the samādhi named Creating Inexhaustibility,

source: བསྟིར་མེད་སྐེམས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Extinguishing Avīci,

source: རྒྱ་མཚོ་ལྟར་ཟབ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། །
en: the samādhi named Ocean Deep,

source: འཁོར་བརྒྱ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་
en: the samādhi named Hundred Retinues,

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ནི་ཏིང་ངེ་འཛིན་དེ་དག་དང་ལྡན་ནོ།
en: Noble son, Bodhisattva Mahāsattva Avalokiteśvara has those samādhis.

source: ལོག་པར་དད་སེལ་ཅེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པ་རིག་པ་དང་རྐང་པར་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་བ་དེའི་ཚེ་
en: When the Tathāgata, the arhat, the samyaksaṃbuddha, perfect in wisdom and conduct, the sugata, the knower of the world, the unsurpassable guide who tames beings, the teacher of gods and humans, the buddha, the Bhagavat Krakucchanda, appeared in this world,

source: དེའི་དུས་ན་ང་བྱང་ཆུབ་སེམས་དཔར་གྱུར་ཏེ། །
en: at that time I was a bodhisattva

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དེའི་སྤྱན་སྔར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་ཡོན་ཏན་བརྗོད་པ་དེ་ལྟ་བུ་ངས་ཐོས་སོ།
en: “When I was in the presence of that tathāgata, I heard that description of the qualities of Avalokiteśvara,

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་ལ་སོགས་པ་དང་འདི་འདྲ་བར་ཏིང་ངེ་འཛིན་གྱིས་འགྱེས་པ་ཡང་ངས་མཐོང་ངོ་། །
en: and I saw these different samādhis of Bodhisattva Samantabhadra and others.

source: གང་གི་ཚེ་ན་ཀུན་དུ་བཟང་པོ་རྡོ་རྗེ་གྱེན་དུ་འཕགས་པའི་ཏིང་ངེ་འཛིན་ལ་ཞུགས་པ་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་འཐོར་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་ཞུགས་སོ།
en: “When Bodhisattva Mahāsattva Samantabhadra was in the samādhi named Ascending Vajra, Bodhisattva Mahāsattva Avalokiteśvara was in the samādhi named Scattering.

source: གང་གི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་དུ་བཟང་པོ་ཟླ་བ་དམ་པའི་མིག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་ཞུགས་པ་དེའི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ཉི་མ་དམ་པའི་མིག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་ཞུགས་སོ། །
en: When Bodhisattva Mahāsattva Samantabhadra was in the samādhi named Moon’s Sublime Illumination, Bodhisattva Mahāsattva Avalokiteśvara was in the samādhi named Sun’s Sublime Illumination.

source: གང་གི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་དུ་བཟང་པོ་བྱུགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་ཞུགས་པ་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ནམ་མཁའ་མཛོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་ཞུགས་སོ། །
en: When Bodhisattva Mahāsattva Samantabhadra was in the samādhi named Sprinkling, Bodhisattva Mahāsattva Avalokiteśvara was in the samādhi named Treasury of Space.

source: གང་གི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོ་དབང་པོ་རྣམ་པར་བྱེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་ཞུགས་པ་
en: “When Bodhisattva Mahāsattva Samantabhadra was in the samādhi named Creating Indra,

source: གང་གི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་དུ་བཟང་པོ་དབང་པོའི་འགྲོས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་ཞུགས་པ་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་རྒྱ་མཚོ་ལྟར་ཟབ་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་ཞུགས་སོ།
en: “When Bodhisattva Mahāsattva Samantabhadra was in the samādhi named Indra’s Way, Bodhisattva Mahāsattva Avalokiteśvara was in the samādhi named Ocean Deep.

source: གང་གི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་དུ་བཟང་པོ་སེང་གེ་གླལ་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་ཞུགས་པ་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་སེང་གེ་རྣམ་པར་རོལ་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་ཞུགས་སོ།
en: “When Bodhisattva Mahāsattva Samantabhadra was in the samādhi named Intimidating Lion, Bodhisattva Mahāsattva Avalokiteśvara was in the samādhi named Play of the Lion.

source: གང་གི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་དུ་བཟང་པོ་དམ་པ་སྦྱིན་པར་བྱེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་ཞུགས་པ་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་བསྟིར་མེད་པ་སྐེམས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་ཞུགས་སོ།
en: “When Bodhisattva Mahāsattva Samantabhadra was in the samādhi named Sublime Gift, Bodhisattva Mahāsattva Avalokiteśvara was in the samādhi named Drying Up Avīci.

source: གང་གི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་དུ་བཟང་པོ་བ་སྤུའི་ཁུང་བུ་ཐམས་ཅད་འབྱེད་པར་བྱེད་པ་
en: “When Bodhisattva Mahāsattva Samantabhadra opened up his pores,
